# Data Manipulation With Pandas

Pandas is built on top of two essential Python packages: Numpy and Matplotlib. Pandas is designed to work with rectangular (or tabular) data. In pandas, rectangular data is represented as a dataframe object. In dataframes, different columns may have different data types.

In [24]:
import pandas as pd

# Sample DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "City": ["New York", "London", "Paris", "New York", "Paris", "London"],
    "Age": [25, 30, 35, 40, 29, 30]
}

df = pd.DataFrame(data)

# return the first few rows of df
print(df.head())

      Name      City  Age
0    Alice  New York   25
1      Bob    London   30
2  Charlie     Paris   35
3    David  New York   40
4      Eve     Paris   29

In [3]:
# display the names of columns, their data types, and missing values(if any)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   City    6 non-null      object
 2   Age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes
None

In [4]:
# display the number of rows and the number of columns
print(df.shape)

(6, 3)

In [5]:
# compute the summary statistics for numerical columns
print(df.describe())

             Age
count   6.000000
mean   31.500000
std     5.244044
min    25.000000
25%    29.250000
50%    30.000000
75%    33.750000
max    40.000000

In [6]:
# show the values of the dataframe
print(df.values)

[['Alice' 'New York' 25]
 ['Bob' 'London' 30]
 ['Charlie' 'Paris' 35]
 ['David' 'New York' 40]
 ['Eve' 'Paris' 29]
 ['Frank' 'London' 30]]

In [7]:
# show the columns of the dataframe

In [8]:
print(df.columns)

Index(['Name', 'City', 'Age'], dtype='object')

In [9]:
# show the index attribute
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [10]:
# sort by one column in ascending order
df.sort_values("Age")

      Name      City  Age
0    Alice  New York   25
4      Eve     Paris   29
1      Bob    London   30
5    Frank    London   30
2  Charlie     Paris   35
3    David  New York   40

In [11]:
# sort by one column in descending order
df.sort_values("Age", ascending= False)

      Name      City  Age
3    David  New York   40
2  Charlie     Paris   35
1      Bob    London   30
5    Frank    London   30
4      Eve     Paris   29
0    Alice  New York   25

In [12]:
# sort by more than one column
df.sort_values(["Age", "City"])

      Name      City  Age
0    Alice  New York   25
4      Eve     Paris   29
1      Bob    London   30
5    Frank    London   30
2  Charlie     Paris   35
3    David  New York   40

In [13]:
df.sort_values(['Age', 'City'], ascending = [True, False])

      Name      City  Age
0    Alice  New York   25
4      Eve     Paris   29
1      Bob    London   30
5    Frank    London   30
2  Charlie     Paris   35
3    David  New York   40

In [14]:
# subsetting df
df["Name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
5      Frank
Name: Name, dtype: object

In [15]:
df[["Name", "Age"]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   29
5    Frank   30

In [16]:
# selects people who are more than 29 years old
df[df["Age"] > 29]

      Name      City  Age
1      Bob    London   30
2  Charlie     Paris   35
3    David  New York   40
5    Frank    London   30

In [25]:
# subset based on multiple conditions
is_london = df["City"] == "London"
is_old = df["Age"] > 29
print(df[is_london & is_old])

    Name    City  Age
1    Bob  London   30
5  Frank  London   30

In [27]:
# get those in New York and paris
is_york_paris = df['City'].isin(['New York', 'Paris'])
result = df[is_york_paris]
print(result)

      Name      City  Age
0    Alice  New York   25
2  Charlie     Paris   35
3    David  New York   40
4      Eve     Paris   29

In [28]:
df["Name_Lenghth"] = df["Name"].apply(len)
print(df)

      Name      City  Age  Name_Lenghth
0    Alice  New York   25             5
1      Bob    London   30             3
2  Charlie     Paris   35             7
3    David  New York   40             5
4      Eve     Paris   29             3
5    Frank    London   30             5

In [29]:
# find the mean of age
df['Age'].mean()

31.5

In [41]:
df["Age"].mode()[0]
df['Age'].quantile(.75)
df[['Age', 'Name_Lenghth']].sum()

Age             189
Name_Lenghth     28
dtype: int64

The agg() method allows you to custom summary statistics. It is useful when you want to apply more than one aggregate funtion

In [40]:
def pct30(column):
    return column.quantile(0.3)

df['Age'].agg(pct30)

29.5

In [45]:
df['Age'].agg(['sum', 'mean'])

sum     189.0
mean     31.5
Name: Age, dtype: float64

In [46]:
df[['Age', 'Name_Lenghth']].agg(['mean', 'median'])

         Age  Name_Lenghth
mean    31.5      4.666667
median  30.0      5.000000

In [47]:
# find the cumulative sum
df['Age'].cumsum()

0     25
1     55
2     90
3    130
4    159
5    189
Name: Age, dtype: int64

In [48]:
# find the cumulative max
df['Age'].cummax()

0    25
1    30
2    35
3    40
4    40
5    40
Name: Age, dtype: int64

In [49]:
# drop duplicate based on city
df.drop_duplicates(subset = 'City')

      Name      City  Age  Name_Lenghth
0    Alice  New York   25             5
1      Bob    London   30             3
2  Charlie     Paris   35             7

In [50]:
df["City"].value_counts() #counts how many times a unique value appear in a column

City
New York    2
London      2
Paris       2
Name: count, dtype: int64

In [51]:
df["City"].value_counts(sort = True) # sorts the vakues descending

City
New York    2
London      2
Paris       2
Name: count, dtype: int64

In [52]:
df["City"].value_counts(normalize = True) # turn the count into the  proportion of the total

City
New York    0.333333
London      0.333333
Paris       0.333333
Name: proportion, dtype: float64

In [53]:
df.groupby('City')['Age'].mean()

City
London      30.0
New York    32.5
Paris       32.0
Name: Age, dtype: float64

In [55]:
df.groupby('City')['Age'].agg(['min', 'max', 'sum'])

          min  max  sum
City
London     30   30   60
New York   25   40   65
Paris      29   35   64

In [56]:
df.groupby(['Name', 'City'])['Age'].mean()

Name     City
Alice    New York    25.0
Bob      London      30.0
Charlie  Paris       35.0
David    New York    40.0
Eve      Paris       29.0
Frank    London      30.0
Name: Age, dtype: float64

Pivot table is another way of calculating summary statistics. Just like using groupby, we can use pivot table to achieve the same result. df.pivot_table(value, index). The value argument is the column you want to summarise, while the index argument is the column you want to group by. By default, pivot table takes the mean value of each group. If you want to use a different summary statistic, we can use the aggfunc argument and pass it a function

In [57]:
df.pivot_table(values = 'Age', index = 'City')

           Age
City
London    30.0
New York  32.5
Paris     32.0

In [60]:
df.pivot_table(values = 'Age', index = 'City', aggfunc = 'sum')

          Age
City
London     60
New York   65
Paris      64

In [61]:
df.pivot_table(values = 'Age', index = 'City', aggfunc = ['sum', 'mean'])

         sum  mean
         Age   Age
City
London    60  30.0
New York  65  32.5
Paris     64  32.0

In [63]:
df.pivot_table(values = 'Age', index = 'City', columns = 'Name') # group by more than one variable

Name      Alice   Bob  Charlie  David   Eve  Frank
City
London      NaN  30.0      NaN    NaN   NaN   30.0
New York   25.0   NaN      NaN   40.0   NaN    NaN
Paris       NaN   NaN     35.0    NaN  29.0    NaN

In [64]:
df.pivot_table(values = 'Age', index = 'City', columns = 'Name', fill_value = 0)

Name      Alice   Bob  Charlie  David   Eve  Frank
City
London      0.0  30.0      0.0    0.0   0.0   30.0
New York   25.0   0.0      0.0   40.0   0.0    0.0
Paris       0.0   0.0     35.0    0.0  29.0    0.0

In [66]:
df.pivot_table(values = 'Age', index = 'City', columns = 'Name', fill_value = 0, margins = True)

Name      Alice   Bob  Charlie  David   Eve  Frank   All
City
London      0.0  30.0      0.0    0.0   0.0   30.0  30.0
New York   25.0   0.0      0.0   40.0   0.0    0.0  32.5
Paris       0.0   0.0     35.0    0.0  29.0    0.0  32.0
All        25.0  30.0     35.0   40.0  29.0   30.0  31.5

In [67]:
df.set_index("Name") # set a column as index

             City  Age  Name_Lenghth
Name
Alice    New York   25             5
Bob        London   30             3
Charlie     Paris   35             7
David    New York   40             5
Eve         Paris   29             3
Frank      London   30             5

In [68]:
df

      Name      City  Age  Name_Lenghth
0    Alice  New York   25             5
1      Bob    London   30             3
2  Charlie     Paris   35             7
3    David  New York   40             5
4      Eve     Paris   29             3
5    Frank    London   30             5

You can only slice an index if the index is sorted (using .sort_index()).
To slice at the outer level, first and last can be strings.
To slice at inner levels, first and last should be tuples.
If you pass a single slice to .loc[], it will slice the rows.